org-dialog.org
# -*- eval: (org-dialog-mode 1); -*-

#+TITLE: org-dialog
#+PROPERTY: header-args:emacs-lisp :tangle org-dialog.el :padline yes :lexical t
#+DIALOG_MODEL: gpt-5.2-chat
#+DIALOG_ENDPOINT: https://pablo-ml1b1csr-eastus2.cognitiveservices.azure.com/openai/v1/chat/completions
#+DIALOG_API_KEY: INFERENCE_API_KEY
#+DIALOG_SYSTEM: You are co-authoring an org mode file with me. Please respond only with utf8 characters. No em-dashes. No sleek arrows. You always reply in a dry concise manner. As short as possible.

* Introduction
In order to have literate tests of the code in this project, since
some of the code operates in a buffer, we use =with-temp-buffer= to
simulate that.

* Scaffolding
#+begin_src emacs-lisp
  ;;; org-dialog.el --- Introduces executable PROMPT org blocks in org-mode -*- lexical-binding: t; -*-
  ;; Author: Pablo
  ;; Version: 0.1.0
  ;; Package-Requires: ((emacs "27.1") (org "9.0"))

  ;;; Code:
  (require 'org)
  (require 'org-element)
  (require 'json)
  (require 'url)
#+end_src

* Parsing org structure into prose/prompt/assistant sections
#+begin_src emacs-lisp
   (defun org-dialog--parse-blocks (pos)
     "Parse dialogue blocks from buffer start to POS.
   Returns ordered list of (TYPE . CONTENT) where TYPE is
   `prose', `prompt', or `assistant'.  Consecutive prose entries
   are merged.  Skips keywords and empty segments."
     (let* (;; 'greater-element granularity: identifies paragraphs, special
            ;; blocks, src blocks, example blocks - without recursing into
            ;; their contents (we extract raw text anyway).
            (tree (org-element-parse-buffer 'greater-element))
            ;; Walk tree in document order, collecting context elements.
            ;; org-element-map finds these at any depth (under headlines).
            ;; nil returns are filtered automatically.
            (raw (org-element-map tree '(paragraph special-block
                                         src-block example-block)
                   (lambda (el)
                     (when (<= (org-element-property :end el) pos)
                       (pcase (org-element-type el)
                         ;; Prose paragraph -> user context
                         ('paragraph
                          (let ((text (string-trim
                                       (buffer-substring-no-properties
                                        (org-element-property :begin el)
                                        (org-element-property :end el)))))
                            (when (> (length text) 0)
                              (cons 'prose text))))
                         ;; Source block -> user context, wrapped in markdown fence
                         ('src-block
                          (let ((lang (or (org-element-property :language el) ""))
                                (value (org-element-property :value el)))
                            (when (and value (> (length (string-trim value)) 0))
                              (cons 'prose
                                    (concat "```" lang "\n"
                                            (string-trim value)
                                            "\n```")))))
                         ;; Example block -> user context, wrapped in fence
                         ('example-block
                          (let ((value (org-element-property :value el)))
                            (when (and value (> (length (string-trim value)) 0))
                              (cons 'prose
                                    (concat "```\n"
                                            (string-trim value)
                                            "\n```")))))
                         ;; PROMPT or ASSISTANT special block
                         ('special-block
                          (let ((type-str (org-element-property :type el))
                                (cb (org-element-property :contents-begin el))
                                (ce (org-element-property :contents-end el)))
                            (when (member (upcase type-str) '("PROMPT" "ASSISTANT"))
                              (let ((content (and cb ce
                                                 (string-trim
                                                  (buffer-substring-no-properties cb ce)))))
                                (when (and content (> (length content) 0))
                                  (cons (if (string-equal-ignore-case type-str "PROMPT")
                                            'prompt 'assistant)
                                        content))))))))))))
       ;; Merge consecutive prose entries so multiple paragraphs and code
       ;; blocks between prompts become one user context message.
       (let ((merged nil))
         (dolist (entry raw)
           (if (and (eq (car entry) 'prose)
                    merged
                    (eq (car (car merged)) 'prose))
               ;; Previous entry was also prose - append with blank line
               (setcar merged (cons 'prose
                                    (concat (cdar merged) "\n\n" (cdr entry))))
             (push entry merged)))
         (nreverse merged))))
#+end_src

#+begin_src emacs-lisp :tangle no :wrap example :results value pp
    (with-temp-buffer
      (insert "#+TITLE: An example user of org-dialog
  This is an example collaboration between human and AI to author an .org
  document together.

  Interpersed within the prose of the document the human can write
  =#+begin_prompt= blocks, with some prompt to AI inside.

  The human then positions the pointer somewhere within the block and
  executes keychord ctrl-c ctrl-c, this sends the prompts to an AI, parses
  the AI's response and puts the response right after the prompt block,
  within a =#+begin_assistant= block.

  ,* Conversation

  ,#+begin_prompt
  What is 2 + 2?
  ,#+end_prompt

  ,#+begin_assistant
  2 + 2 = 4
  ,#+end_assistant

  ,#+begin_src python
  def add(a, b):
      return a + b
  ,#+end_src

  ,#+begin_prompt
  Multiply that by 5
  ,#+end_prompt")
      (org-dialog--parse-blocks (point-max)))
#+end_src

#+RESULTS:
#+begin_example
((prose
  . "This is an example collaboration between human and AI to author an .org\ndocument together.\n\nInterpersed within the prose of the document the human can write\n=#+begin_prompt= blocks, with some prompt to AI inside.\n\nThe human then positions the pointer somewhere within the block and\nexecutes keychord ctrl-c ctrl-c, this sends the prompts to an AI, parses\nthe AI's response and puts the response right after the prompt block,\nwithin a =#+begin_assistant= block.")

 (prompt . "What is 2 + 2?")

 (assistant . "2 + 2 = 4")

 (prose . "```python\ndef add(a, b):\n    return a + b\n```")

 (prompt . "Multiply that by 5"))
#+end_example

* Preparing LLM request
#+begin_src emacs-lisp
  (defun org-dialog--blocks-to-messages (blocks config)
    "Converts BLOCKS to OpenAI messages array.
  CONFIG is a plist with :system."
    (let ((messages nil)
  	(system (plist-get config :system)))
      (when system
        (push `((role . "system") (content . ,system)) messages))
      (dolist (block blocks)
        (let ((type (car block))
  	    (content (cdr block)))
  	(push `((role . ,(if (eq type 'assistant) "assistant" "user"))
  		(content . ,content))
  	      messages)))
      (nreverse messages)))
#+end_src

Example:

#+begin_src emacs-lisp :tangle no :wrap example :results value pp
  (let ((blocks '((prose . "This is an example collaboration between human and AI to author an .org\ndocument together.\n\nInterpersed within the prose of the document the human can write\n=#+begin_prompt= blocks, with some prompt to AI inside.\n\nThe human then positions the pointer somewhere within the block and\nexecutes keychord ctrl-c ctrl-c, this sends the prompts to an AI, parses\nthe AI's response and puts the response right after the prompt block,\nwithin a =#+begin_assistant= block.")
                  (prompt . "What is 2 + 2?")
                  (assistant . "2 + 2 = 4")
                  (prose . "```python\ndef add(a, b):\n    return a + b\n```")
                  (prompt . "Multiply that by 5"))))
    (org-dialog--blocks-to-messages blocks '(:system "You are a helpful assistant.")))
#+end_src

#+RESULTS:
#+begin_example
(((role . "system") (content . "You are a helpful assistant."))
 ((role . "user")
  (content
   . "This is an example collaboration between human and AI to author an .org\ndocument together.\n\nInterpersed within the prose of the document the human can write\n=#+begin_prompt= blocks, with some prompt to AI inside.\n\nThe human then positions the pointer somewhere within the block and\nexecutes keychord ctrl-c ctrl-c, this sends the prompts to an AI, parses\nthe AI's response and puts the response right after the prompt block,\nwithin a =#+begin_assistant= block."))
 ((role . "user") (content . "What is 2 + 2?"))
 ((role . "assistant") (content . "2 + 2 = 4"))
 ((role . "user")
  (content . "```python\ndef add(a, b):\n    return a + b\n```"))
 ((role . "user") (content . "Multiply that by 5")))
#+end_example

