org-dialog.el
;;; org-dialog.el --- Introduces executable PROMPT org blocks in org-mode -*- lexical-binding: t; -*-
;; Author: Pablo
;; Version: 0.1.0
;; Package-Requires: ((emacs "27.1") (org "9.0"))

;;; Code:
(require 'org)
(require 'org-element)
(require 'json)
(require 'url)

(defun org-dialog--parse-blocks (pos)
  "Parse dialogue blocks from buffer start to POS.
Returns ordered list of (TYPE . CONTENT) where TYPE is
`prose', `prompt', or `assistant'.  Consecutive prose entries
are merged.  Skips keywords and empty segments."
  (let* (;; 'greater-element granularity: identifies paragraphs, special
         ;; blocks, src blocks, example blocks - without recursing into
         ;; their contents (we extract raw text anyway).
         (tree (org-element-parse-buffer 'greater-element))
         ;; Walk tree in document order, collecting context elements.
         ;; org-element-map finds these at any depth (under headlines).
         ;; nil returns are filtered automatically.
         (raw (org-element-map tree '(paragraph special-block
                                      src-block example-block)
                (lambda (el)
                  (when (<= (org-element-property :end el) pos)
                    (pcase (org-element-type el)
                      ;; Prose paragraph -> user context
                      ('paragraph
                       (let ((text (string-trim
                                    (buffer-substring-no-properties
                                     (org-element-property :begin el)
                                     (org-element-property :end el)))))
                         (when (> (length text) 0)
                           (cons 'prose text))))
                      ;; Source block -> user context, wrapped in markdown fence
                      ('src-block
                       (let ((lang (or (org-element-property :language el) ""))
                             (value (org-element-property :value el)))
                         (when (and value (> (length (string-trim value)) 0))
                           (cons 'prose
                                 (concat "```" lang "\n"
                                         (string-trim value)
                                         "\n```")))))
                      ;; Example block -> user context, wrapped in fence
                      ('example-block
                       (let ((value (org-element-property :value el)))
                         (when (and value (> (length (string-trim value)) 0))
                           (cons 'prose
                                 (concat "```\n"
                                         (string-trim value)
                                         "\n```")))))
                      ;; PROMPT or ASSISTANT special block
                      ('special-block
                       (let ((type-str (org-element-property :type el))
                             (cb (org-element-property :contents-begin el))
                             (ce (org-element-property :contents-end el)))
                         (when (member (upcase type-str) '("PROMPT" "ASSISTANT"))
                           (let ((content (and cb ce
                                              (string-trim
                                               (buffer-substring-no-properties cb ce)))))
                             (when (and content (> (length content) 0))
                               (cons (if (string-equal-ignore-case type-str "PROMPT")
                                         'prompt 'assistant)
                                     content))))))))))))
    ;; Merge consecutive prose entries so multiple paragraphs and code
    ;; blocks between prompts become one user context message.
    (let ((merged nil))
      (dolist (entry raw)
        (if (and (eq (car entry) 'prose)
                 merged
                 (eq (car (car merged)) 'prose))
            ;; Previous entry was also prose - append with blank line
            (setcar merged (cons 'prose
                                 (concat (cdar merged) "\n\n" (cdr entry))))
          (push entry merged)))
      (nreverse merged))))

(defun org-dialog--blocks-to-messages (blocks config)
  "Converts BLOCKS to OpenAI messages array.
CONFIG is a plist with :system."
  (let ((messages nil)
	(system (plist-get config :system)))
    (when system
      (push `((role . "system") (content . ,system)) messages))
    (dolist (block blocks)
      (let ((type (car block))
	    (content (cdr block)))
	(push `((role . ,(if (eq type 'assistant) "assistant" "user"))
		(content . ,content))
	      messages)))
    (nreverse messages)))
