org-dialog.org
* Execute inference
#+begin_src emacs-lisp
  (defun org-dialog--infer (messages config callback error-callback)
    "Send MESSAGES to a Chat Completions endpoint.
  CONFIG is a plist with :endpoint :api-key :model.
  CALLBACK receives the response text.
  ERROR-CALLBACK receives an error string."
    (let* ((endpoint (plist-get config :endpoint))
           (api-key  (plist-get config :api-key))
           (model    (plist-get config :model))
           (url-request-method "POST")
           (url-request-extra-headers
            `(("Content-Type"  . "application/json")
              ("Authorization" . ,(concat "Bearer " api-key))))
           (url-request-data
            (encode-coding-string
             (json-serialize `((model . ,model)
                               (messages . ,(vconcat messages))))
             'utf-8)))
      (url-retrieve
       endpoint
       (lambda (status cb err-cb)
         (if (or (plist-get status :error)
                 (null url-http-end-of-headers))
             (funcall err-cb
                      (format "HTTP error: %s"
                              (or (plist-get status :error) "no response headers")))
           (goto-char url-http-end-of-headers)
           (condition-case e
               (let* ((json-object-type 'alist)
                      (json-array-type  'vector)
                      (resp (json-read))
                      (choices (alist-get 'choices resp))
                      (text (and choices
                                 (> (length choices) 0)
                                 (alist-get 'content
                                            (alist-get 'message
                                                       (aref choices 0))))))
                 (if text
                     (funcall cb text)
                   (funcall err-cb
                            (format "No content in response: %s"
                                    (buffer-substring (point) (point-max))))))
             (error
              (funcall err-cb
                       (format "JSON parse error: %s" e))))))
       (list callback error-callback) t)))
#+end_src

Sanity check - hits the endpoint synchronously:

#+begin_src emacs-lisp :tangle no :wrap example :results value pp :tangle no
  (let* ((url-request-method "POST")
         (url-request-extra-headers
          `(("Content-Type"  . "application/json")
            ("Authorization" . ,(concat "Bearer " (getenv "INFERENCE_API_KEY")))))
         (url-request-data
          (encode-coding-string
           (json-encode
            `((model . "gpt-5.2-chat")
              (messages . [((role . "user") (content . "What is 2 + 2?"))])))
           'utf-8))
         (buf (url-retrieve-synchronously
  	     "https://pablo-ml1b1csr-eastus2.cognitiveservices.azure.com/openai/v1/chat/completions")))
    (with-current-buffer buf
      (goto-char url-http-end-of-headers)
      (let* ((json-object-type 'alist)
             (json-array-type 'vector)
             (resp (json-read)))
        resp)))
#+end_src

#+RESULTS:
#+begin_example
((choices
  . [((content_filter_results
       (hate (filtered . :json-false) (severity . "safe"))
       (protected_material_code (filtered . :json-false)
				(detected . :json-false))
       (protected_material_text (filtered . :json-false)
				(detected . :json-false))
       (self_harm (filtered . :json-false) (severity . "safe"))
       (sexual (filtered . :json-false) (severity . "safe"))
       (violence (filtered . :json-false) (severity . "safe")))
      (finish_reason . "stop") (index . 0) (logprobs)
      (message (annotations . []) (content . "2 + 2 = **4**.")
	       (refusal) (role . "assistant")))])
 (created . 1770494705)
 (id . "chatcmpl-D6iq9PJjUpjckDcJ2bN4WmUWfVFNS")
 (model . "gpt-5.2-chat-2025-12-11") (object . "chat.completion")
 (prompt_filter_results
  . [((prompt_index . 0)
      (content_filter_results
       (hate (filtered . :json-false) (severity . "safe"))
       (jailbreak (filtered . :json-false) (detected . :json-false))
       (self_harm (filtered . :json-false) (severity . "safe"))
       (sexual (filtered . :json-false) (severity . "safe"))
       (violence (filtered . :json-false) (severity . "safe"))))])
 (system_fingerprint)
 (usage (completion_tokens . 19)
	(completion_tokens_details (accepted_prediction_tokens . 0)
				   (audio_tokens . 0)
				   (reasoning_tokens . 0)
				   (rejected_prediction_tokens . 0))
	(prompt_tokens . 14)
	(prompt_tokens_details (audio_tokens . 0) (cached_tokens . 0))
	(total_tokens . 33)))
#+end_example

* Escape org syntax in assistant responses
#+begin_src emacs-lisp
  (defun org-dialog--escape-org (text)
    "Comma-escape lines in TEXT that org would interpret as structure.
  Escapes lines starting with `*' (headings) or `#+' (keywords/blocks)."
    (replace-regexp-in-string
     "^\\(\\*\\|#\\+\\)" ",\\1" text))
#+end_src

* Execute a PROMPT block
#+begin_src emacs-lisp
  (defun org-dialog-execute ()
    "Send the current prompt block to inference endpoint and insert the response."
    (interactive)
    (let ((bounds (org-dialog--in-prompt-p)))
      (unless bounds
        (user-error "Not inside a #+BEGIN_PROMPT block"))
      (let* ((prompt-end (cdr bounds))
  	   (config (org-dialog--config))
  	   (blocks (org-dialog--parse-blocks prompt-end))
  	   (messages (org-dialog--blocks-to-messages blocks config))
  	   (buf (current-buffer))
  	   (inhibit-read-only t))
        ;; Set read-only
        (setq buffer-read-only t)
        (message "org-dialog: inferring...")
        (funcall #'org-dialog--infer
  	       messages config
  	       (lambda (text)
  		 (with-current-buffer buf
  		   (let ((inhibit-read-only t))
  		     (save-excursion
  		       (goto-char prompt-end)
  		       (let ((case-fold-search t)
  			     (insert-at nil))
  			 ;; Check for existing assistant block immediately after
  			 (save-excursion
  			   (forward-line 1)
  			   (skip-chars-forward " \t\n")
  			   (when (looking-at "^[\t]*#\\+begin_assistant")
  			     (setq insert-at (point))))
  			 (if insert-at
  			     ;; replace content of existing assistant block
  			     (progn
  			       (goto-char insert-at)
  			       (forward-line 1)
  			       (let ((content-start (point)))
  				 (re-search-forward "^[ \t]*#\\+end_assistant")
  				 (delete-region content-start (line-beginning-position))
  				 (goto-char content-start)
  				 (insert (org-dialog--escape-org text) "\n")))
  			   ;; Insert new assistant block
  			   (goto-char prompt-end)
  			   (end-of-line)
  			   (insert "\n\n#+begin_assistant\n"
  				   (org-dialog--escape-org text)
  				   "\n#+end_assistant"))))
  		     ; (org-dialog--apply-overlays)
  		     (org-dialog--apply-overlays)
  		     (setq buffer-read-only nil)
  		     (message "org-dialog: done."))))
  	       ;; Error callback
  	       (lambda (err)
  		 (with-current-buffer buf
  		   (let ((inhibit-read-only t))
  		     (setq buffer-read-only nil))
  		   (message "org-dialog error: %s" err)))))))
#+end_src

* Utilities
** Get settings from org file header
#+begin_src emacs-lisp
  ;;; Config
  (defun org-dialog--keyword (key)
    "Read a #+KEY: value from the current org buffer."
    (cadr (assoc key (org-collect-keywords (list key)))))
#+end_src

Example - can retrieve the model.

#+begin_src emacs-lisp :tangle no :wrap example :results value pp 
  (with-temp-buffer
    (insert "#+TITLE: An org dialog file\n#+DIALOG_MODEL: gpt-5.2-chat")
    (org-dialog--keyword "DIALOG_MODEL"))
#+end_src

#+RESULTS:
#+begin_example
"gpt-5.2-chat"
#+end_example

** Gather all settings
#+begin_src emacs-lisp
  (defun org-dialog--config ()
    "Compose dialog config from buffer keywords.
  Returns plist (:model :endpoint :api-key :system)."
    (let* ((model (org-dialog--keyword "DIALOG_MODEL"))
  	 (endpoint (org-dialog--keyword "DIALOG_ENDPOINT"))
  	 (api-key-env (org-dialog--keyword "DIALOG_API_KEY"))
  	 (api-key (getenv api-key-env))
  	 (system (org-dialog--keyword "DIALOG_SYSTEM")))
      (unless model (user-error "No #+DIALOG_MODEL: set"))
      (unless endpoint (user-error "No #+DIALOG_ENDPOINT: set"))
      (unless api-key (user-error "No #+DIALOG_API_KEY: set"))

      (list :model model :endpoint endpoint :api-key api-key :system system)))
#+end_src

Example -- all settings read and returned.

#+begin_src emacs-lisp :tangle no :wrap example :results value pp
  (with-temp-buffer
    (org-mode)
    (setq-local process-environment (cons "MY_API_KEY=abc123" process-environment))
    (insert "#+TITLE: An example org dialog
  ,#+DIALOG_MODEL: gpt-5.2-chat
  ,#+DIALOG_ENDPOINT: https://foo.bar/v1/completions
  ,#+DIALOG_API_KEY: MY_API_KEY
  ,#+DIALOG_SYSTEM: You are a helpful assistant co-writing an org mode file with me

  ,* Introduction
  The goal of this dialog is to...
  ")
    (org-dialog--config))
#+end_src

#+RESULTS:
#+begin_example
  (:model "gpt-5.2-chat"
   :endpoint "https://foo.bar/v1/completions"
   :api-key "abc123"
   :system "You are a helpful assistant co-writing an org mode file with me")
#+end_example

** Detect if pointer on prompt block
#+begin_src emacs-lisp
  ;;; Block detection
  (defun org-dialog--in-prompt-p ()
      "Return (BEG . END) if point is inside a #+begin_prompt block, nil otherwise.
  BEG is the start of #+begin_prompt line, END is the end of #+end_prompt line."
    (save-excursion
      (let ((pos (point))
  	  (case-fold-search t))
        (when (re-search-backward "^[ \t]*#\\+begin_prompt" nil t)
  	(let ((beg (line-beginning-position)))
  	  (when (re-search-forward "^[ \t]*#\\+end_prompt" nil t)
  	    (let ((end (line-end-position)))
  	      (when ( <= pos end)
  		(cons beg end)))))))))
#+end_src

Example - can detect whether point is at a prompt block or not:

#+begin_src emacs-lisp :tangle no :wrap example :results output
    (with-temp-buffer
      (org-mode)
      (insert "* A heading
  ,#+begin_prompt
  How old is earth
  ,#+end_prompt")
      (princ (format "In prompt: %s\n" (org-dialog--in-prompt-p)))
      (insert "
  Some more different text")
      (princ (format "In prompt: %s" (org-dialog--in-prompt-p))))
#+end_src

#+RESULTS:
#+begin_example
In prompt: (13 . 57)
In prompt: nil
#+end_example

* User experience Look and feel
