org-dialog.el

(defun org-dialog--infer (messages config callback error-callback)
  "Send MESSAGES to a Chat Completions endpoint.
CONFIG is a plist with :endpoint :api-key :model.
CALLBACK receives the response text.
ERROR-CALLBACK receives an error string."
  (let* ((endpoint (plist-get config :endpoint))
         (api-key  (plist-get config :api-key))
         (model    (plist-get config :model))
         (url-request-method "POST")
         (url-request-extra-headers
          `(("Content-Type"  . "application/json")
            ("Authorization" . ,(concat "Bearer " api-key))))
         (url-request-data
          (encode-coding-string
           (json-serialize `((model . ,model)
                             (messages . ,(vconcat messages))))
           'utf-8)))
    (url-retrieve
     endpoint
     (lambda (status cb err-cb)
       (if (or (plist-get status :error)
               (null url-http-end-of-headers))
           (funcall err-cb
                    (format "HTTP error: %s"
                            (or (plist-get status :error) "no response headers")))
         (goto-char url-http-end-of-headers)
         (condition-case e
             (let* ((json-object-type 'alist)
                    (json-array-type  'vector)
                    (resp (json-read))
                    (choices (alist-get 'choices resp))
                    (text (and choices
                               (> (length choices) 0)
                               (alist-get 'content
                                          (alist-get 'message
                                                     (aref choices 0))))))
               (if text
                   (funcall cb text)
                 (funcall err-cb
                          (format "No content in response: %s"
                                  (buffer-substring (point) (point-max))))))
           (error
            (funcall err-cb
                     (format "JSON parse error: %s" e))))))
     (list callback error-callback) t)))

(defun org-dialog--escape-org (text)
  "Comma-escape lines in TEXT that org would interpret as structure.
Escapes lines starting with `*' (headings) or `#+' (keywords/blocks)."
  (replace-regexp-in-string
   "^\\(\\*\\|#\\+\\)" ",\\1" text))

(defun org-dialog-execute ()
  "Send the current prompt block to inference endpoint and insert the response."
  (interactive)
  (let ((bounds (org-dialog--in-prompt-p)))
    (unless bounds
      (user-error "Not inside a #+BEGIN_PROMPT block"))
    (let* ((prompt-end (cdr bounds))
	   (config (org-dialog--config))
	   (blocks (org-dialog--parse-blocks prompt-end))
	   (messages (org-dialog--blocks-to-messages blocks config))
	   (buf (current-buffer))
	   (inhibit-read-only t))
      ;; Set read-only
      (setq buffer-read-only t)
      (message "org-dialog: inferring...")
      (funcall #'org-dialog--infer
	       messages config
	       (lambda (text)
		 (with-current-buffer buf
		   (let ((inhibit-read-only t))
		     (save-excursion
		       (goto-char prompt-end)
		       (let ((case-fold-search t)
			     (insert-at nil))
			 ;; Check for existing assistant block immediately after
			 (save-excursion
			   (forward-line 1)
			   (skip-chars-forward " \t\n")
			   (when (looking-at "^[\t]*#\\+begin_assistant")
			     (setq insert-at (point))))
			 (if insert-at
			     ;; replace content of existing assistant block
			     (progn
			       (goto-char insert-at)
			       (forward-line 1)
			       (let ((content-start (point)))
				 (re-search-forward "^[ \t]*#\\+end_assistant")
				 (delete-region content-start (line-beginning-position))
				 (goto-char content-start)
				 (insert (org-dialog--escape-org text) "\n")))
			   ;; Insert new assistant block
			   (goto-char prompt-end)
			   (end-of-line)
			   (insert "\n\n#+begin_assistant\n"
				   (org-dialog--escape-org text)
				   "\n#+end_assistant"))))
		     ; (org-dialog--apply-overlays)
		     (org-dialog--apply-overlays)
		     (setq buffer-read-only nil)
		     (message "org-dialog: done."))))
	       ;; Error callback
	       (lambda (err)
		 (with-current-buffer buf
		   (let ((inhibit-read-only t))
		     (setq buffer-read-only nil))
		   (message "org-dialog error: %s" err)))))))

;;; Config
(defun org-dialog--keyword (key)
  "Read a #+KEY: value from the current org buffer."
  (cadr (assoc key (org-collect-keywords (list key)))))

(defun org-dialog--config ()
  "Compose dialog config from buffer keywords.
Returns plist (:model :endpoint :api-key :system)."
  (let* ((model (org-dialog--keyword "DIALOG_MODEL"))
	 (endpoint (org-dialog--keyword "DIALOG_ENDPOINT"))
	 (api-key-env (org-dialog--keyword "DIALOG_API_KEY"))
	 (api-key (getenv api-key-env))
	 (system (org-dialog--keyword "DIALOG_SYSTEM")))
    (unless model (user-error "No #+DIALOG_MODEL: set"))
    (unless endpoint (user-error "No #+DIALOG_ENDPOINT: set"))
    (unless api-key (user-error "No #+DIALOG_API_KEY: set"))

    (list :model model :endpoint endpoint :api-key api-key :system system)))

;;; Block detection
(defun org-dialog--in-prompt-p ()
    "Return (BEG . END) if point is inside a #+begin_prompt block, nil otherwise.
BEG is the start of #+begin_prompt line, END is the end of #+end_prompt line."
  (save-excursion
    (let ((pos (point))
	  (case-fold-search t))
      (when (re-search-backward "^[ \t]*#\\+begin_prompt" nil t)
	(let ((beg (line-beginning-position)))
	  (when (re-search-forward "^[ \t]*#\\+end_prompt" nil t)
	    (let ((end (line-end-position)))
	      (when ( <= pos end)
		(cons beg end)))))))))
