org-dialog.org
** Different color for assisant block content
#+begin_src emacs-lisp
(defface org-dialog-assistant
  '((((background dark))
     :foreground "#88c0d0" :slant italic :extend t)
    (((background light))
     :foreground "#3465a4" :slant italic :extend t))
  "Face for assistant block content."
  :group 'org-dialog)
#+end_src

** Apply overlays (face, indent)
#+begin_src emacs-lisp
(defun org-dialog--apply-overlays ()
  "Apply face overlays to all assistant block contents in the buffer."
  (remove-overlays (point-min) (point-max) 'org-dialog-assistant t)
  (save-excursion
    (goto-char (point-min))
    (let ((case-fold-search t))
      (while (re-search-forward "^[ \t]*#\\+BEGIN_ASSISTANT" nil t)
        (let ((content-start (progn (forward-line 1) (point))))
          (when (re-search-forward "^[ \t]*#\\+END_ASSISTANT" nil t)
            (let* ((content-end (line-beginning-position))
                   (ov (make-overlay content-start content-end nil t nil)))
              (overlay-put ov 'org-dialog-assistant t)
              (overlay-put ov 'face 'org-dialog-assistant)
              (overlay-put ov 'line-prefix "  ")
              (overlay-put ov 'wrap-prefix "  "))))))))
#+end_src

** Keybindings
#+begin_src emacs-lisp
;;; C-c C-c hook

(defun org-dialog--ctrl-c-ctrl-c ()
  "Hook for `org-ctrl-c-ctrl-c-hook'.
If point is inside a prompt block, execute it and return t."
  (when (org-dialog--in-prompt-p)
    (org-dialog-execute)
    t))
#+end_src

* Footer
#+begin_src emacs-lisp
  ;;; Minor mode

  ;;;###autoload
  (define-minor-mode org-dialog-mode
    "Minor mode for LLM dialog notebooks in org-mode.
  Intercepts C-c C-c inside #+BEGIN_PROMPT blocks to send
  conversation history to an LLM and insert the response."
    :lighter " Dia"
    :group 'org-dialog
    (if org-dialog-mode
        (progn
          (add-hook 'org-ctrl-c-ctrl-c-hook
                    #'org-dialog--ctrl-c-ctrl-c nil t)
          (org-dialog--apply-overlays))
      (remove-hook 'org-ctrl-c-ctrl-c-hook
                   #'org-dialog--ctrl-c-ctrl-c t)
      (remove-overlays (point-min) (point-max) 'org-dialog-assistant t)))

    (provide 'org-dialog)
    ;;; org-dialog.el ends here
#+end_src

* Exploration

#+begin_prompt
What do you think of this project?
#+end_prompt

#+begin_assistant
Notes.

- Overall structure is coherent. Literate tests with with-temp-buffer are appropriate.
- org-dialog--parse-blocks is the most complex part. Add unit tests for mixed nesting and headlines.
- Keyword error typo: "No #+DIAG_MODEL:" should be "DIALOG_MODEL".
- org-dialog--infer uses chat completions schema. Works for current endpoint but is brittle.
- org-dialog-execute sets buffer-read-only twice. Simplify with unwind-protect.
- org-dialog--escape-org should also handle leading commas already present.
- Overlay application is correct but O(n) on whole buffer each run.
- Consider making org-dialog--blocks-to-messages treat prose before first prompt as system or user explicitly.
#+end_assistant

#+begin_prompt
give me an improved version of the TOC (what you would name each section)
#+end_prompt

#+begin_assistant
Solid project.

- Clear goal and good org integration.
- Parsing approach is reasonable and testable.
- Literate tests are well done.
- Code is readable and idiomatic.

Concerns.

- parse-blocks complexity and edge cases need more tests.
- Inference layer is tightly coupled to one API shape.
- Error handling and read-only toggling need cleanup.
- Performance may degrade on large buffers.

Overall: promising, usable, needs hardening.
#+end_assistant
