org-dialog.el

(defface org-dialog-assistant
  '((((background dark))
     :foreground "#88c0d0" :slant italic :extend t)
    (((background light))
     :foreground "#3465a4" :slant italic :extend t))
  "Face for assistant block content."
  :group 'org-dialog)

(defun org-dialog--apply-overlays ()
  "Apply face overlays to all assistant block contents in the buffer."
  (remove-overlays (point-min) (point-max) 'org-dialog-assistant t)
  (save-excursion
    (goto-char (point-min))
    (let ((case-fold-search t))
      (while (re-search-forward "^[ \t]*#\\+BEGIN_ASSISTANT" nil t)
        (let ((content-start (progn (forward-line 1) (point))))
          (when (re-search-forward "^[ \t]*#\\+END_ASSISTANT" nil t)
            (let* ((content-end (line-beginning-position))
                   (ov (make-overlay content-start content-end nil t nil)))
              (overlay-put ov 'org-dialog-assistant t)
              (overlay-put ov 'face 'org-dialog-assistant)
              (overlay-put ov 'line-prefix "  ")
              (overlay-put ov 'wrap-prefix "  "))))))))

;;; C-c C-c hook

(defun org-dialog--ctrl-c-ctrl-c ()
  "Hook for `org-ctrl-c-ctrl-c-hook'.
If point is inside a prompt block, execute it and return t."
  (when (org-dialog--in-prompt-p)
    (org-dialog-execute)
    t))

;;; Minor mode

;;;###autoload
(define-minor-mode org-dialog-mode
  "Minor mode for LLM dialog notebooks in org-mode.
Intercepts C-c C-c inside #+BEGIN_PROMPT blocks to send
conversation history to an LLM and insert the response."
  :lighter " Dia"
  :group 'org-dialog
  (if org-dialog-mode
      (progn
        (add-hook 'org-ctrl-c-ctrl-c-hook
                  #'org-dialog--ctrl-c-ctrl-c nil t)
        (org-dialog--apply-overlays))
    (remove-hook 'org-ctrl-c-ctrl-c-hook
                 #'org-dialog--ctrl-c-ctrl-c t)
    (remove-overlays (point-min) (point-max) 'org-dialog-assistant t)))

  (provide 'org-dialog)
  ;;; org-dialog.el ends here
